**Fundamentals of pandas**
---

In [0]:
import pandas as pd

In [0]:
d = {'Quarters' : ['Quarter1','Quarter2','Quarter3','Quarter4'],
     'Revenue':[23400344.567,54363744.678,56789117.456,4132454.987]}
df=pd.DataFrame(d)

In [3]:
df

   Quarters       Revenue
0  Quarter1  2.340034e+07
1  Quarter2  5.436374e+07
2  Quarter3  5.678912e+07
3  Quarter4  4.132455e+06

**Delete One Column**

In [0]:
df = df.drop(['Quarters'] ,axis =1)

In [5]:
df

        Revenue
0  2.340034e+07
1  5.436374e+07
2  5.678912e+07
3  4.132455e+06

**Head and tail function in Python pandas (Get First N Rows & Last N Rows)**

---



1.   Head Function in Python (Get First N Rows):
2.   Tail Function in Python (Get Last N Rows):



---

**Head Function in Python (Get First N Rows):**

Head function with no arguments gets the first five rows of data from the data frame.

**Tail Function in Python (Get Last N Rows):**

Tail function with no arguments gets the last five rows of data from the data frame.

In [0]:
iris = pd.read_csv('https://gist.githubusercontent.com/curran/a08a1080b88344b0c8a7/raw/d546eaee765268bf2f487608c537c05e22e4b221/iris.csv')

In [7]:
# head function in python
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [8]:
# head function in python with arguments
iris.head(8)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa

In [9]:
# tail function in python
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [10]:
# tail function in python with arguments
 
iris.tail(8)

     sepal_length  sepal_width  petal_length  petal_width    species
142           5.8          2.7           5.1          1.9  virginica
143           6.8          3.2           5.9          2.3  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

**Descriptive or Summary Statistics in python pandas**



---



```
Descriptive or summary statistics in python – pandas, can be obtained by using describe function – describe(). Describe Function gives the mean, std and IQR values.

1.   Generally describe() function excludes the character columns and gives summary statistics of numeric columns
2.   We need to add a variable named include=’all’ to get the summary statistics or descriptive statistics of both numeric and character column.

```

In [11]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [12]:
iris.describe(include=['object'])

       species
count      150
unique       3
top     setosa
freq        50

In [13]:
# summary statistics of character column
 
iris.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.054000      3.758667     1.198667     NaN
std         0.828066     0.433594      1.764420     0.763161     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

**Mean of the dataframe:**

In [14]:
iris.mean()

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

In [15]:
# column mean of the dataframe
iris.mean(axis=0)

sepal_length    5.843333
sepal_width     3.054000
petal_length    3.758667
petal_width     1.198667
dtype: float64

**Calculate the mean of the specific Column**

In [16]:
# mean of the specific column
iris.loc[:,"sepal_length"].mean()

5.843333333333335

**Median Function in Python pandas (Dataframe, Row and column wise median)**


---

median() 

Median Function in python pandas is used to calculate the median or middle value of a given set of numbers, Median of a data frame, median of column and median of rows, let’s see an example of each. We need to use the package name “statistics” in calculation of median.

In [17]:
iris.median()

sepal_length    5.80
sepal_width     3.00
petal_length    4.35
petal_width     1.30
dtype: float64

In [18]:
# median of the specific column
iris.loc[:,"sepal_length"].median()

5.8

**Standard deviation of the dataframe:**

In [19]:
iris.std()

sepal_length    0.828066
sepal_width     0.433594
petal_length    1.764420
petal_width     0.763161
dtype: float64

**How to join (merge) data frames (inner, outer, right, left join) in pandas python**


---



```
We can merge two data frames in pandas python by using the merge() function. The different arguments to merge() allow you to perform natural join,  left join, right join, and full outer join in pandas.
```

1.  left− Dataframe1.

2.  right– Dataframe2.

3.  on− Columns (names) to join on. Must be found in both the left and right DataFrame objects.

4.  how – type of join needs to be performed – ‘left’, ‘right’, ‘outer’, ‘inner’, Default is inner join



---

The data frames must have same column names on which the merging happens. Merge() Function in pandas is similar to database join operation in SQL.


**UNDERSTANDING THE DIFFERENT TYPES OF MERGE:**

1 . Natural join: To keep only rows that match from the data frames, specify the argument how=‘inner’.

2 . Full outer join:To keep all rows from both data frames, specify how=‘outer’.

3 . Left outer join:To include all the rows of your data frame x and only those from y that match, specify how=‘left’.

4 . Right outer join:To include all the rows of your data frame y and only those from x that match, specify how=‘right’.


![alt text](http://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png)

In [0]:
import pandas as pd
import numpy as np
 
# data frame 1
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
  'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television'])}
df1 = pd.DataFrame(d1)
 
 
# data frame 2
d2 = {'Customer_id':pd.Series([2,4,6]),
    'State':pd.Series(['California','California','Texas'])}
df2 = pd.DataFrame(d2)

In [21]:
df1

   Customer_id     Product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

In [22]:
df2

   Customer_id       State
0            2  California
1            4  California
2            6       Texas

In [0]:
df = pd.merge(df1, df2, on='Customer_id', how='inner')

In [24]:
df

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

*Outer join pandas: Returns all rows from both tables, join records from the left which have matching keys in the right table.*

In [0]:
df3 =pd.merge(df1, df2, on='Customer_id', how='outer')

In [26]:
df3

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

*Left outer join pandas: Return all rows from the left table, and any rows with matching keys from the right table.*

In [0]:
right_out = pd.merge(df1, df2, on='Customer_id', how='left')

In [28]:
right_out

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

*Right outer join pandas: Return all rows from the right table, and any rows with matching keys from the left table.*

In [0]:
right_outer_join = pd.merge(df1, df2, on='Customer_id', how='right')

In [30]:
right_outer_join

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas